// Порівняння об'єктів: Імплементуйте функцію isObjectsEqual, яка порівнює два об'єкта і повертає true,
//якщо вони мають однакові ключі та значення, і false в іншому випадку.

// Примітка 1: В даній задачі об'єкти можуть мати лише властивості примітивних типів.
// Жоден з об'єктів не містить методів Примітка
// 2: В даній задачі якщо будь-яке значення є рядком то регістр слід ігнорувати.
// Тобто "javaScript" та "JAVASCRIPT" слід вважати рівними значеннями.

// const object1 ={
//     title: "Tyhrolovy",
//     author: "Ivan Bahrianyi",
//     year: 1944
// }

// const object2 ={
//     title: "Tyhrolovy",
//     author: "Ivan Bahrianyi",
//     year: 1944
// }

// function isObjectsEqual(input1, input2){
// for()
// }
